Revit 2027 API
Parameter.CanBeAssociatedWithGlobalParameters Method
 Tests whether this parameter can be associated with any global parameter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool CanBeAssociatedWithGlobalParameters()
Public Function CanBeAssociatedWithGlobalParameters As Boolean
public:
bool CanBeAssociatedWithGlobalParameters()
member CanBeAssociatedWithGlobalParameters : unit -> bool
Return Value
Boolean
 True if the given parameter can be associated (is parametrizable); False otherwise.
Exceptions
Exception | Condition
ArgumentException |  This parameter does not exist in the document anymore.
Remarks
 Only properties defined as parametrizable can be associated with global parameters. That excludes any read-only and formula-driven parameters, as well as those that have other explicit or implicit restrictions imposed by Revit.
See Also
Reference
Parameter Class
Autodesk.Revit.DB Namespace